{
    "laptops": [
    {
        "name": "Acer Chromebook Spin 13",
        "description": "Intel Core i3 8th Gen 8130U (2.20 GHz), 4 GB LPDDR3 Memory 128 GB eMMC, Intel UHD Graphics 620, 2256 x 1504",
        "price": 726.99,
        "brand": "Acer",
        "product_type": "Chromebook"
    },
    {
        "name": "Lenovo Flex 3",
        "description": "Packs what makes Chromebook so amazing into one svelte 360-degree convertible. Versatile and portable, the IdeaPad Flex 3 Chromebook measures just 19.6 mm thick and weighs 1.2 kg with a full keyboard and spacious trackpad, and can be viewed in tent, tablet, laptop or stand modes",
        "brand": "Lenovo",
        "price": 159,
        "product_type": "Chromebook"
    },
    {
        "name": "ASUS Chromebook Flip 2-in-1",
        "description": "14 inch Touchscreen FHD 1920 x 1080 4-way NanoEdge display featuring ultra-narrow bezels (5 mm thin) around each side of the display that allows for a 14 inch screen to fit in the body of a 13 inch laptop footprint.",
        "brand": "ASUS",
        "price": 319,
        "product_type": "Chromebook"
    },
    {
        "name": "HP Chromebook 11A",
        "description": "Education Edition Chromebook, 4 GB DDR4 (provided memory is soldered), 11.6\" WLED 1366 x 768 / HD, AMD Radeon R4",
        "brand": "HP",
        "price": 159.99,
        "product_type": "Chromebook"
    },
    {
        "name": "Samsung Chromebook 4",
        "description": "Chromebook Simplicity. Galaxy Style. Introducing Galaxy Chromebook. A cutting edge Chromebook engineered to offer a whole new experience. Go simple. Work smarter.",
        "brand": "Samsung",
        "price": 167.06,
        "product_type": "Chromebook"
    },
    {
        "name": "Dell Chromebook 11 3000",
        "description": "HD, 1366 x 768, Intel Celeron N4020 Dual-core (2 Core), 4 GB RAM, 32 GB Flash Memory",
        "brand": "Dell",
        "price": 230,
        "product_type": "Chromebook"
    },
    {
        "name": "2022 Lenovo Thinkpad E15 Gen 3",
        "description": "The Latest ThinkPad E-series E15, A Successor to E590, Features 15.6\" Full HD (1920x1080) IPS Anti-glare 300nits Display; Integrated AMD Radeon Graphics - Supports external digital monitor via HDMI or USB Type-C, Max external to 3 digital monitors with docking station; External monitor resolution: 4K(4096x2160)",
        "brand": "Lenovo",
        "price": 899.99,
        "product_type": "Business"
    },
    {
        "name": "2022 ASUS ExpertBook B1 B1400",
        "description": "11th Generation Intel Quad-Core i5-1135G7 Processor (2.40 GHz, up to 4.20 GHz with Turbo Boost, 4 Cores, 8 Threads, 8 MB Cache); 24GB DDR4 Memory (8GB Soldered + 16GB SO-DIMM), 1TB PCIe NVMe M.2 SSD",
        "brand": "ASUS",
        "price": 799.99,
        "product_type": "Business"
    },
    {
        "name": "Acer Aspire 5",
        "description": "Ergonomic Typing: Ergonomically-designed hinge lifts the keyboard for comfortable typing, improved cooling, and a better sound experience.",
        "brand": "Acer",
        "price": 549.99,
        "product_type": "Business"
    },
    {
        "name": "Dell Inspiron 15 3000",
        "description": "Dell Inspiron Laptop: Optimize your productivity with this 15.6-inch Dell Inspiron laptop with an FHD screen. The 11th Generation Intel Core i7 processor and DDR4 RAM provide reliable performance, while the SSD blend ample storage and rapid startup times. Equipped with the ports you need to be productive, including a HDMI, and SD card reader.",
        "brand": "Dell",
        "price": 1075,
        "product_type": "Business"
    },
    {
        "name": "HP 15 FHD Business&Home Notebook",
        "description": "HP 15 FHD Business&Home Notebook, Intel Core I5-1135G7 Upto 4.2GHz, 12GB RAM, 256GB NVMe SSD, HDMI, Card Reader, Wi-Fi, Bluetooth, Windows 10 Pro / w Lone Star Computer Mouse Pad",
        "brand": "HP",
        "price": 557.79,
        "product_type": "Business"
    },
    {
        "name": "Samsung Galaxy Book Pro 15 Business",
        "description": "Combining the latest Intel 11th Gen Core processor with Windows 11 OS and designed on the Intel® Evo platform, Samsung Galaxy Book Pro comes in under two pounds, so its the perfect mix of portability and productivity. Make everything you do look unbelievably brilliant with a 15.6 AMOLED screen thats the most advanced ever in a Galaxy Book.",
        "brand": "Samsung",
        "price": 1049,
        "product_type": "Business"
    },
    {
        "name": "Lenovo Legion 5 Pro",
        "description": "AMD Ryzen 7 5800H Octa-core, NVIDIA GeForce RTX 3070 8GB GDDR6, Windows 11 OS, 2560 x 1600 WQXGA 165Hz Display, In-Plane Switching (IPS) Technology",
        "brand": "Lenovo",
        "price": 1399.99,
        "product_type": "Gaming"
    },
    {
        "name": "ASUS ROG Strix Scar 15",
        "description": "Exceptional speed, power, and performance elevate the ROG Strix SCAR 15 to the top tier of Windows 11 gaming. The AMD Ryzen™ 5000 series processors and powerful GeForce graphics saturate the cutting-edge 300 Hz / 3 ms gaming panel that takes you to the next frontier of pro esports speed.",
        "brand": "ASUS",
        "price": 1999.99,
        "product_type": "Gaming"
    },
    {
        "name": "Acer Nitro 5",
        "description": "NVIDIA GeForce RTX 3060 Laptop GPU 6 GB GDDR6, Intel Core i5 12th Gen 12500H (2.50GHz), 16GB Memory 512 GB PCIe SSD, 15.6\" 1920 x 1080 IPS display with 144Hz Refresh Rate, 16:9 aspect ratio, 14.19\" x 10.67\" x 1.06\" 5.51 lbs., 1 x HDMI 2.1 Port with HDCP support",
        "brand": "Acer",
        "price": 849.99,
        "product_type": "Gaming"
    },
    {
        "name": "HP Victus 15",
        "description": "Experience desktop-level performance and capabilities with an AMD Ryzen 7 5800H Mobile Processor and DDR4 memory. Enjoy all your favorite games in stunning detail with the NVIDIA GeForce RTX 3050 Ti Laptop GPU, featuring 4 GB of dedicated memory. Reduce frustrating lag and image ghosting with a display that combines a 144Hz refresh rate and 1080p resolution for smooth, crisp gameplay. Game or stream longer without slow-down thanks to the updated thermal design -- perfect for keeping your device cooled even when your gameplay heats up. Elevate your play on a full-sized, all-in-one gaming keyboard, complete with plenty of finger space, and a bigger touchpad for more accurate clicking. Whether you need to jump on a quick work call or coordinate with your team, do it in the clearest way possible with an HD camera, featuring Temporal Noise Reduction which eliminates unwanted background noise.",
        "brand": "HP",
        "price": 876.38,
        "product_type": "Gaming"
    },
    {
        "name": "Dell G15 Ryzen Edition",
        "description": "4th Gen AMD Ryzen 5 5600H 3.30GHz Processor (upto 4.2 GHz, 16MB Cache, 6-Cores, 12-Threads, ) ; NVIDIA RTX 3050 4GB GDDR6 Dedicated Graphics. 64GB DDR4 SODIMM ; Wi-Fi 6 AX1650 Wifi, Bluetooth 5.2, Ethernet LAN (RJ-45), 720p HD Webcam, Backlit.",
        "brand": "Dell",
        "price": 889.99,
        "product_type": "Gaming"
    },
    {
        "name": "Samsung Galaxy Book Odyssey",
        "description": "A laptop PC that's packed with power for work or play. Crush all your productivity goals like never before, whether it's a work-related project or your personal to-do list. And when it's time to kick back, you can stream or game to your heart's content with stunning visuals and stellar audio, all powered by a long-lasting battery.",
        "brand": "Samsung",
        "price": 1399.99,
        "product_type": ["Gaming", "Business"]
    },
    {
        "name": "ASUS TUF A17 (2022)",
        "description": "Jump right into the action with the TUF Gaming A17. Stream and multitask with ease thanks to an AMD Ryzen 7 6800H Mobile Processor and 16 GB of blisteringly fast 4800 MHz DDR5 RAM on Windows 11 Home. Leverage the full gaming performance of the GeForce RTX 3060 GPU with a dedicated MUX Switch. When your game library gets full, an empty M.2 NVMe PCIe Gen 4x4 SSD slot makes upgrading storage capacity a breeze.",
        "brand": "ASUS",
        "price": 1279.99,
        "product_type": "Gaming"
    },
    {
        "name": "ASUS ROG Zephyrus Duo 16",
        "description": "ScreenPad Plus: 14 inch 4K (3840x1100) secondary touchscreen display - Game, Stream, Create, and more! NVIDIA GeForce RTX 3080 Ti 16GB GDDR6 - ROG Boost up to 1445MHz at 165W in Manual mode or 150W in Turbo mode (140W + 10W/25W with Dynamic Boost) ROG Nebula HDR Display - It guarantees minimum brightness, color representation, refresh rates, response times, and more. Enjoy flicker-free, anti-blue light displays that cut down on screen tearing with Variable Refresh Rate technology. ",
        "brand": "ASUS",
        "price": 3851.99,
        "product_type": "Gaming"
    },
    {
        "name": "Acer Predator Helios 300",
        "description": "The Helios 300 drops you right into the game with everything you need to obliterate the opposition. Only now, we’ve armed it with the new NVIDIA GeForce RTX 3050 Ti laptop graphics, the latest 11th Gen Intel Core i7 processor and our custom-engineered 5th Gen AeroBlade 3D Fan Technology. With the 144Hz IPS panel, you can say farewell to blur and hello clear, crisp, high-octane gameplay.",
        "brand": "Acer",
        "price": 1299.99,
        "product_type": "Gaming"
    },
    {
        "name": "Acer Predator Triton 300 SE",
        "description": "NVIDIA GeForce RTX 3070 Ti Laptop GPU 8 GB GDDR6, Intel Core i7 12th Gen 12700H (2.30GHz), 16GB Memory 1 TB PCIe SSD, 16.0\" 2560 x 1600 IPS Display with NVIDIA G-SYNC technology, 240Hz Refresh Rate, 16:10 Aspect Ratio, 500nit Brightness, DCI-P3 100%",
        "brand": "Acer",
        "price": 2016.99,
        "product_type": "Gaming"
    },
    {
        "name": "Acer ConceptD 3 Pro",
        "description": "Liberate yourself from the office and take your creativity on the go. With an extended battery life to last you throughout the day, the ConceptD 3 Pro's powerful NVIDIA Quadro T10001 graphics card and its 9th Gen Intel Core i5 Processor is ready to handle all of your 2D or 3D design work on a beautiful, up to 15.6\" FHD PANTONE Validated display. When you create, create in style. The premium and stylish aluminum alloy chassis keeps the weight of this highly portable laptop down to a svelte 1.41kg.",
        "brand": "Acer",
        "price": 1029.99,
        "product_type": "Business"
    },
    {
        "name": "Lenovo ThinkBook 15 Gen 4",
        "description": "Experience powerful computing while on-the-go with the 15.6\" ThinkBook 15 Gen 4. Designed with a 1.7 GHz Intel Core-i7 10-core CPU and DDR4 RAM, this laptop is designed for professional business use and daily computing. Store important business documents on the M.2 SSD. Experience smooth on-screen visuals thanks to the integrated Intel Iris Xe graphics paired with the 15.6\" Full HD IPS display.",
        "brand": "Lenovo",
        "price": 1199.99,
        "product_type": "Business"
    },
    {
        "name": "HP Pavilion 15",
        "description": "AMD Ryzen 7 5700U, 8-Core, 1.8 GHz base frequency, up to 4.3 GHz Max Boost Frequency with integrated AMD Radeon Graphics. 15.6-inch diagonal Full HD 1080p IPS Micro-edge BrightView display. Intel Wi-Fi 6 AX200 (2x2) and Bluetooth 5 combo, HP Wide Vision 720p HD camera, B&O Audio",
        "brand": "HP",
        "price": 999.99,
        "product_type": "Business"
    },
    {
        "name": "Dell Precision 3560",
        "description": "Intel Core i7 11th Gen 1185G7 (3.00GHz), 16GB Memory 512 GB PCIe SSD, NVIDIA T500, 1920 x 1080, Windows 10 Pro 64-bit",
        "brand": "Dell",
        "price": 1499.99,
        "product_type": "Business"
    },
    {
        "name": "ASUS ProArt StudioBook",
        "description": "Mobile Workstation, Intel Core i9 12th Gen 12900H (2.50GHz), 32GB Memory, 2 TB PCIe SSD, NVIDIA RTX A3000, 16.0\" 4K Display, Windows 11 Pro 64-bit",
        "brand": "ASUS",
        "price": 3012.99,
        "product_type": "Business"
    },
    {
        "name": "ASUS Chromebook Enterprise",
        "description": "Intel Core i7 11th Gen 1165G7 (2.80GHz), 16GB Memory, 512 GB PCIe SSD, 14.0\" 1920x1080 Touchscreen, Intel Iris Xe Graphics, Chrome OS",
        "brand": "ASUS",
        "price": 1762.99,
        "product_type": ["Chromebook, Business"]
    },
    {
        "name": "Dell Latitude 7410",
        "description": "14\" Touchscreen, Rugged 2 in 1 Chromebook - Full HD - 1920 x 1080 - Intel Core i5 (10th Gen) i5-10310U Quad-core (4 Core) 1.70 GHz - 8 GB RAM - 128 GB SSD - Aluminium - IEEE 802.11ax Wireless LAN",
        "brand": "DELL",
        "price": 1683.99,
        "product_type": ["Chromebook", "Business"]
    },
    {
        "name": "Acer Chromebook Enterprise Spin 713",
        "description": "Product Type: 2 in 1 Chromebook, Processor Manufacturer: Intel, Processor Type: Core i7, Processor Generation: 11th Gen, Processor Model: i7-1165G7, Processor Core: Quad-core (4 Core), Processor Speed: 2.80 GHz, Maximum Turbo Speed: 4.70 GHz, Cache: 12 MB, Standard Memory: 16 GB, Memory Configuration: 4 x 4GB,",
        "brand": "Acer",
        "price": 1313.99,
        "product_type": ["Chromebook", "Business"]
    }
    ]
}
